In [1]:
%autosave 5

Autosaving every 5 seconds

In [11]:
import pandas as pd
from glob import glob

In [13]:
files = glob('*.csv')
files

['iris.csv', 'penguins.csv', 'planets.csv']

In [3]:
scores = {
    'name': ['Ray', 'Japhy', 'Zosa'],
    'city': ['San Francisco', 'San Francisco', 'Denver'],
    'score': [75, 92, 94]
}

In [4]:
df = pd.DataFrame(scores)

In [5]:
df

    name           city  score
0    Ray  San Francisco     75
1  Japhy  San Francisco     92
2   Zosa         Denver     94

In [6]:
df['score']

0    75
1    92
2    94
Name: score, dtype: int64

In [8]:
df['name_city'] = df['name'] + '_' + df['city']

In [9]:
df

    name           city  score            name_city
0    Ray  San Francisco     75    Ray_San Francisco
1  Japhy  San Francisco     92  Japhy_San Francisco
2   Zosa         Denver     94          Zosa_Denver

In [10]:
df[df['score'] > 90]

    name           city  score            name_city
1  Japhy  San Francisco     92  Japhy_San Francisco
2   Zosa         Denver     94          Zosa_Denver

In [14]:
iris = pd.read_csv('iris.csv')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [15]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [16]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [17]:
iris.loc[3:5]

   sepal_length  sepal_width  petal_length  petal_width species
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [18]:
iris.loc[3, 'sepal_length']

4.6

In [19]:
iris.loc[3:5]

   sepal_length  sepal_width  petal_length  petal_width species
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [20]:
iris.iloc[3, 0]

4.6

In [22]:
iris.to_csv('iris-output.csv', index=False)

In [23]:
glob('*.csv')

['iris-output.csv', 'iris.csv', 'penguins.csv', 'planets.csv']

In [24]:
emissions = pd.DataFrame({
    'country': ['China', 'United States', 'India'],
    'year': ['2018', '2018', '2018'],
    'co2_emissions': [10060000000.0, 5410000000.0, 2650000000.0]
})

In [25]:
emissions

         country  year  co2_emissions
0          China  2018   1.006000e+10
1  United States  2018   5.410000e+09
2          India  2018   2.650000e+09

In [26]:
pd.set_option('max_rows', 2)

In [27]:
emissions

   country  year  co2_emissions
0    China  2018   1.006000e+10
..     ...   ...            ...
2    India  2018   2.650000e+09

[3 rows x 3 columns]

In [29]:
pd.set_option('max_columns', 2)

In [30]:
emissions

   country  ... co2_emissions
0    China  ...  1.006000e+10
..     ...  ...           ...
2    India  ...  2.650000e+09

[3 rows x 3 columns]

In [32]:
pd.options.display.float_format = '{:,.2f}'.format

In [33]:
emissions

   country  ...     co2_emissions
0    China  ... 10,060,000,000.00
..     ...  ...               ...
2    India  ...  2,650,000,000.00

[3 rows x 3 columns]

In [35]:
pd.options.display.max_info_columns = 1

In [36]:
emissions

   country  ...     co2_emissions
0    China  ... 10,060,000,000.00
..     ...  ...               ...
2    India  ...  2,650,000,000.00

[3 rows x 3 columns]

In [37]:
glob('*.csv')

['iris-output.csv', 'iris.csv', 'penguins.csv', 'planets.csv']

In [38]:
planets = pd.read_csv('planets.csv')

In [39]:
planets

               method  ...  year
0     Radial Velocity  ...  2006
...               ...  ...   ...
1034          Transit  ...  2008

[1035 rows x 6 columns]